lvx/base/Documents/бит_му_МодернизацияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_МодернизацияОС</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>InformationRegister.бит_му_ПараметрыОС</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>InformationRegister.бит_му_СобытияОС</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыОперацийМодернизацияОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение, по которому оформлен документ</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ПодразделениеМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>МОЛ, по которому оформлен документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
					<Comment>Основные средства</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Comment>Основное средство</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования_Старый</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактСрокИспользования</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииРабот_Старый</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПродукцииРабот</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактОбъемПродукцииРабот</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМодернизации</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФактическогоОбесценения</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Амортизация</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодНачисленияАмортизации_Старый</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодНачисленияАмортизации</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентУскорения_Старый</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентУскорения</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛиквидационнаяСтоимость_Старый</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛиквидационнаяСтоимость</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНезавершенногоСтроительства</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>Аналитика счета незавершенного строительства 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>Аналитика счета незавершенного строительства 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>Аналитика счета незавершенного строительства 3</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто4</Name>
							<Comment>Аналитика счета незавершенного строительства 4</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаМодернизации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Enums/бит_му_ВидыОперацийМодернизацияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_ВидыОперацийМодернизацияОС</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновныеСредства</Name>
					<Comment>Основные средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционнаяСобственность</Name>
					<Comment>Инвестиционная собственность</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Documents/бит_му_МодернизацияОС/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем мКэшРеквизитовФормы; // Хранит текущие значения реквизитов формы

&НаКлиенте
Перем мНастройкиСубконтоСчетовМУ; // Хранит настройки видимости полей субконто.
  
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
		
	Если Отказ Тогда
		Возврат;
    КонецЕсли;
    
	ЗаполнитьКэшЗначений();
					
	// Максимальное количество субконто на счете по МУ.
	КоличествоСубконтоМУ = 4;
	
	// Заполняем подменю, вызываемое нажатием кнопки "Операция" командной панели 
	// формы, значениями перечисления "Вид операции" данного вида документа.
	УстановитьПодменюВыбораВидаОперации();	
	
	Если Параметры.Ключ.Пустая() Тогда  		
		// Заполним валюту МСФО.
		ЗаполнитьВалютуМСФО(); 
		УстановитьСостояниеДокумента();
	Иначе 		
		// Заполним валюту МСФО.
		ЗаполнитьВалютуМСФО(Ложь); 		
	КонецЕсли;

	// Установка связей параметров выбора и связей по типу субконто.
	бит_БухгалтерскийУчет.УстановитьСвязиСубконто(Элементы
												   , "СчетНезавершенногоСтроительства"
												   , "Субконто"
												   , КоличествоСубконтоМУ
												   , "ОсновныеСредства"
												   , "Элементы.ОсновныеСредства.ТекущиеДанные");							   
	
	// Восстановление отображения субконто по количеству доступных.
	ВосстановитьКоличествоДоступныхСубконто();
	
	// Заполнить соответствие объектов ОС и их инвентарных номеров.
	СоответствиеОС_ИнвентарныйНомер = Новый Соответствие;
	бит_му_ВНА.ЗаполнитьИнвентарныеНомераТаблицыОС(Объект.ОсновныеСредства, Объект.Организация, СоответствиеОС_ИнвентарныйНомер);	
	КэшЗначений.Вставить("СоответствиеОС_ИнвентарныйНомер", СоответствиеОС_ИнвентарныйНомер);
	    	
	НастроитьОформлениеФормы();
	
	ВыполнитьВсеРасчетыТаблицыОС();

	УстановитьПараметрыВыбораДляСчетов();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Изменение кода. Начало. 11.03.2015{{
	Если Параметры.Ключ.Пустая() Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда

			// Вид операции
			СформироватьДеревоВидовОпераций();
			
			Если Не бит_УправлениеПользователямиВызовСервера.ЗначениеПоУмолчаниюТиповой("ЗапрашиватьВидОперацииПриВводеНового") Тогда
				
				ПриОткрытииЭтоНовыйОкончание(Неопределено, Отказ);
				
			Иначе 
			
				Оповещение = Новый ОписаниеОповещения("ВыборВидаОперацииОкончание", ЭтотОбъект); 
				
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("СсылкаДокумента"    , Объект.Ссылка);
				ПараметрыФормы.Вставить("ДеревоВидовОпераций", ДеревоВидовОпераций);
				ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораВидаОперацииИзДерева", ПараметрыФормы, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
				
			КонецЕсли;	
				
		Иначе
			
			ПриОткрытииПромежуточная(Отказ);
			ПриОткрытииОкончание();
			
		КонецЕсли;
						
	Иначе
		
		ПриОткрытииОкончание();
		
	КонецЕсли;
	// Изменение кода. Конец. 11.03.2015}}
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("Действие") Тогда
			
			Если ВРег(ВыбранноеЗначение.Действие) = ВРег("Загрузить") Тогда
				
				Если Объект.ОсновныеСредства.Количество() > 0 Тогда
					
					Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораЗавершение", ЭтотОбъект, ВыбранноеЗначение);
					ТекстВопроса = НСтр("ru='Табличная часть ""Основные средства"" будет очищена. Продолжить?';
					                    |en='Tabular part of ""Fixed assets"" will be cleared. Continue?'");
					ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
					
				Иначе
					
					ДобавитьЗагрузитьОС(ВыбранноеЗначение, ПроверитьВозможностьЗаполненияПараметров());
					
				КонецЕсли;
				
			Иначе
				
				ДобавитьЗагрузитьОС(ВыбранноеЗначение, ПроверитьВозможностьЗаполненияПараметров());
				
			КонецЕсли;
			
		КонецЕсли; // В структуре есть поле действие 
		
	КонецЕсли; // Это структура
	
КонецПроцедуры // ОбработкаВыбора()

// Процедура - завершение выбора ОС.
// 
&НаКлиенте
Процедура ОбработкаВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ОсновныеСредства.Очистить();
	Иначе
		Возврат;
	КонецЕсли;
	
	ДобавитьЗагрузитьОС(ДополнительныеПараметры, ПроверитьВозможностьЗаполненияПараметров());
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ВосстановитьОтображениеДанныхФормы();
	
КонецПроцедуры // ПослеЗаписи()

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьСостояниеДокумента();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_му_МодернизацияОС";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если мКэшРеквизитовФормы.Организация <> Объект.Организация Тогда
	
		Если Объект.ОсновныеСредства.Количество() > 0 Тогда
			
			Оповещение = Новый ОписаниеОповещения("ОбработатьИзменениеОрганизации", ЭтотОбъект, Элемент);
			ТекстВопроса = НСтр("ru='Табличная часть ""Основные средства"" будет очищена. Продолжить?';
			                    |en='Tabular part of ""Fixed assets"" will be cleared. Continue?'");
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
		
		Иначе
			
			ТекстСообщения = "";
			ИзменениеОрганизацииСервер(ТекстСообщения);
			ВывестиТекстСообщенийПользователю(ТекстСообщения);

			ДобавитьВКэш(Элемент.Имя);
			
		КонецЕсли;
		
	Иначе
		
		ДобавитьВКэш(Элемент.Имя);
		
	КонецЕсли;

КонецПроцедуры // ОрганизацияПриИзменении()

// Процедура - завершение изменения реквизита "Организация".
// 
&НаКлиенте
Процедура ОбработатьИзменениеОрганизации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		ИзвлечьИзКэша(ДополнительныеПараметры.Имя);
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "";
	ИзменениеОрганизацииСервер(ТекстСообщения);
	ВывестиТекстСообщенийПользователю(ТекстСообщения);
	
	ДобавитьВКэш(ДополнительныеПараметры.Имя);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПроверитьВыбранноеПодразделение(ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры // ПодразделениеОбработкаВыбора()

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	ИзменениеВалютыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Установим новый курс на дату документа
	УстановитьКурсКратностьДокумента(Объект.ВалютаДокумента, Объект.Дата, Объект.КурсДокумента, Объект.КратностьДокумента);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновныеСредства

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменениеОсновногоСредстваСервер(ТекущиеДанные.ПолучитьИдентификатор(), ПроверитьВозможностьЗаполненияПараметров());
			
КонецПроцедуры // ОсновныеСредстваОсновноеСредствоПриИзменении()

&НаКлиенте
Процедура ОсновныеСредстваМетодНачисленияАмортизацииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменениеМетодаНачисленияАмортизацииСервер(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры // ОсновныеСредстваМетодНачисленияАмортизацииПриИзменении()

&НаКлиенте
Процедура ОсновныеСредстваСчетНезавершенногоСтроительстваПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
   	ИзменениеСчетаНезавершенногоСтроительстваСервер(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры // ОсновныеСредстваСчетНезавершенногоСтроительстваПриИзменении()

&НаКлиенте
Процедура ОсновныеСредстваСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеСубконто = ПолучитьЗначениеСубконтоТабПоле(ТекущиеДанные, "ОсновныеСредства", Элемент.Имя);		
	НачалоВыбораСубконто(Элемент, СтандартнаяОбработка, ТекущиеДанные, "Субконто", ЗначениеСубконто);
	
КонецПроцедуры // ОсновныеСредстваСубконтоНачалоВыбора()

&НаКлиенте
Процедура ОсновныеСредстваСубконтоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеСубконто = ПолучитьЗначениеСубконтоТабПоле(ТекущиеДанные, "ОсновныеСредства", Элемент.Имя);		
	ИзменениеСубконто(ТекущиеДанные, "Субконто", ЗначениеСубконто);
	
КонецПроцедуры // ОсновныеСредстваСубконтоПриИзменении()

&НаКлиенте
Процедура ОсновныеСредстваСубконтоАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	ЗначениеСубконто = ТекущиеДанные[СтрЗаменить(Элемент.Имя, "ОсновныеСредства", "")];
	
	ПараметрыСубконто = Новый Структура;
	ПараметрыСубконто.Вставить("ИмяСубконто"       , "Субконто");
	ПараметрыСубконто.Вставить("ЗначениеСубконто"  , ЗначениеСубконто);
	ПараметрыСубконто.Вставить("КоличествоСубконто", КоличествоСубконтоМУ);
	бит_БухгалтерияКлиент.СубконтоАвтоПодбор(Элемент, Параметры, ТекущиеДанные, Объект, ПараметрыСубконто);
	
КонецПроцедуры // ОсновныеСредстваСубконтоАвтоПодбор()

&НаКлиенте
Процедура ОсновныеСредстваСрокПолезногоИспользованияПриИзменении(Элемент)
	
	ВычислитьОставшийсяСрокПолезногоИспользования();
	
КонецПроцедуры // ОсновныеСредстваСрокПолезногоИспользованияПриИзменении()

&НаКлиенте
Процедура ОсновныеСредстваФактСрокИспользованияПриИзменении(Элемент)
	
	ВычислитьОставшийсяСрокПолезногоИспользования();
	
КонецПроцедуры // ОсновныеСредстваФактСрокИспользованияПриИзменении()

&НаКлиенте
Процедура ОсновныеСредстваОбъемПродукцииРаботПриИзменении(Элемент)
	
	ВычислитьОставшийсяОбъемПродукцииРабот();

КонецПроцедуры // ОсновныеСредстваОбъемПродукцииРаботПриИзменении()

&НаКлиенте
Процедура ОсновныеСредстваФактОбъемПродукцииРаботПриИзменении(Элемент)
	
	ВычислитьОставшийсяОбъемПродукцииРабот();
	
КонецПроцедуры // ОсновныеСредстваФактОбъемПродукцииРаботПриИзменении()

&НаКлиенте
Процедура ОсновныеСредстваСтоимостьПриИзменении(Элемент)
	
	ВычислитьОстаточнуюСтоимость();
	
КонецПроцедуры // ОсновныеСредстваСтоимостьПриИзменении()

&НаКлиенте
Процедура ОсновныеСредстваСуммаМодернизацииПриИзменении(Элемент)
	
	ВычислитьОстаточнуюСтоимость();
	
КонецПроцедуры // ОсновныеСредстваСуммаМодернизацииПриИзменении()

&НаКлиенте
Процедура ОсновныеСредстваСуммаФактическогоОбесцененияПриИзменении(Элемент)
	
	ВычислитьОстаточнуюСтоимость();
	
КонецПроцедуры // ОсновныеСредстваСуммаФактическогоОбесцененияПриИзменении()

&НаКлиенте
Процедура ОсновныеСредстваАмортизацияПриИзменении(Элемент)
	
	ВычислитьОстаточнуюСтоимость();
	
КонецПроцедуры // ОсновныеСредстваАмортизацияПриИзменении()

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте 
Процедура ДействияФормыДействиеУстановитьОперацию(Команда)

	Если Команда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	                                             	
	ПредыдущийВидОперации = Объект.ВидОперации;
	ИмяВидаОперации       = СтрЗаменить(Команда.Имя, "КомандаПодменюВидаОперации_", "");
	Объект.ВидОперации    = КэшЗначений.Перечисления.бит_му_ВидыОперацийМодернизацияОС[ИмяВидаОперации];
		
	Если ПредыдущийВидОперации = Объект.ВидОперации Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ОсновныеСредства.Количество() > 0 Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПредыдущийВидОперации", ПредыдущийВидОперации);
		
		Оповещение = Новый ОписаниеОповещения("КомандаУстановитьОперациюЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru='Табличная часть ""Основные средства"" будет очищена. Продолжить?';
		                    |en='Tabular part of ""Fixed assets"" will be cleared. Continue?'"); 		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);
		
	Иначе	
			
		Модифицированность = Истина;

	КонецЕсли;
	
КонецПроцедуры // ДействияФормыДействиеУстановитьОперацию()

// Процедура - завершение обработки команды "УстановитьОперацию".
// 
&НаКлиенте
Процедура КомандаУстановитьОперациюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ОсновныеСредства.Очистить();
	Иначе
		Объект.ВидОперации = ДополнительныеПараметры["ПредыдущийВидОперации"];
		Возврат;
	КонецЕсли;
		
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПодборОС(Команда)
	
	ПараметрыФормы = ЗаполнитьПараметрыПодбора();
	
	ОткрытьФорму("Обработка.бит_му_ПодборВНА.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры // ПодборОС()
     
&НаКлиенте
Процедура ЗаполнитьПараметрыДляВсехОС(Команда)
	
	Если Объект.ОсновныеСредства.Количество() > 0 Тогда
	
		Оповещение = Новый ОписаниеОповещения("КомандаЗаполнитьПараметрыДляВсехОСЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Параметры в табличной части ""Основные средства"" будут перезаполнены. Продолжить?';
		                    |en='Options in the tables of ""Fixed assets"" will be refilled. Continue?'"); 		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет);

	Иначе
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПараметрыДляВсехОС()

// Процедура - завершение обработки команды "ЗаполнитьПараметрыДляВсехОС".
// 
&НаКлиенте
Процедура КомандаЗаполнитьПараметрыДляВсехОСЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПерезаполнитьПараметрыТаблицыОССервер(ПроверитьВозможностьЗаполненияПараметров());
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

   
&НаКлиенте
Процедура ЗаполнитьПараметрыДляТекущегоОС(Команда)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Для заполнения параметров необходимо выбрать строку с ОС, для которого необходимо заполнить параметры.';
		                      |en='To fill the parameters necessary to select the line with the operating system for which the parameters are required.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ОсновноеСредство) Тогда
		Возврат;
	КонецЕсли;
	
	// Получим параметры по ОС.
	ПолучитьПараметрыОССервер(ТекущиеДанные.ПолучитьИдентификатор(), , Истина, ПроверитьВозможностьЗаполненияПараметров());

	Модифицированность = Истина;
	
КонецПроцедуры // ЗаполнитьПараметрыДляТекущегоОС()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеСлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшЗначений()

	КэшЗначений = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшЗначений.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	КэшЗначений.Вставить("ИмяТипаОбъекта", "ДокументОбъект." + МетаданныеОбъекта.Имя);
			
	КэшПеречисления = Новый Структура;
	КэшПеречисления.Вставить("бит_му_ВидыОперацийМодернизацияОС"
							, бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_му_ВидыОперацийМодернизацияОС));
	КэшПеречисления.Вставить("бит_му_МетодыНачисленияАмортизации"
							, бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_му_МетодыНачисленияАмортизации));
	КэшПеречисления.Вставить("бит_му_ВидыКлассовОС"
							, бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_му_ВидыКлассовОС));						
	КэшПеречисления.Вставить("бит_му_РежимыПодбораВНА"		     
							, бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_му_РежимыПодбораВНА));

	КэшЗначений.Вставить("Перечисления", КэшПеречисления);
		
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Процедура ЗаполнитьКэшНастроекСубконто(КэшНастроек)
	
	КэшНастроек = Новый Соответствие;
	
	Для Каждого ТекСтрока Из Объект.ОсновныеСредства Цикл
		
		Если КэшНастроек[ТекСтрока.СчетНезавершенногоСтроительства] = Неопределено Тогда
			НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(ТекСтрока.СчетНезавершенногоСтроительства, КоличествоСубконтоМУ);
			КэшНастроек.Вставить(ТекСтрока.СчетНезавершенногоСтроительства, НастройкиСубконто);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьКэшНастроекСубконто()

&НаСервере
Процедура УстановитьПодменюВыбораВидаОперации()

	ИмяПодменю 	   = "ПодменюВидаОперации";
	ГруппаПодменю  = Элементы.ПодменюВидаОперации;
	ИмяДействия    = "ДействияФормыДействиеУстановитьОперацию";
	
	// Заполняем виды операций для группы подменю.
	Для каждого ЭлементЗаполнения Из Объект.ВидОперации.Метаданные().ЗначенияПеречисления Цикл
		
		ИмяЗначенияПеречисления = ЭлементЗаполнения.Имя;
		ЗначениеПеречисления 	= Перечисления.бит_му_ВидыОперацийМодернизацияОС[ИмяЗначенияПеречисления];
		
		ИмяКнопки  = ИмяПодменю + "_" + ИмяЗначенияПеречисления;
		
		ПараметрыКнопки = бит_РаботаСДиалогамиСервер.ПараметрыКнопкиНаФорму();
		ПараметрыКнопки.Заголовок = ЭлементЗаполнения.Синоним;
		бит_РаботаСДиалогамиСервер.ДобавитьКнопкуНаФорму(Элементы, ЭтотОбъект.Команды, ИмяКнопки, 
			ИмяДействия, ПараметрыКнопки, ГруппаПодменю);
		            		
	КонецЦикла;																				   

КонецПроцедуры // УстановитьПодменюВыбораВидаОперации()

&НаСервере
Процедура ЗаполнитьВалютуМСФО(ЗаполнитьВалютуДокумента = Истина)
	
	// Получим валюту международного учета.
	ВалютаМСФО 	     = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Объект.Организация);
	СтрокаВалютаМежУчета = Строка(ВалютаМСФО);
	
	Элементы.ДекорацияВалютаМСФО.Заголовок = ?(ПустаяСтрока(СтрокаВалютаМежУчета), НСтр("ru='НЕ УСТАНОВЛЕНА';en='NOT SET'"), СтрокаВалютаМежУчета);
	
	Если ЗаполнитьВалютуДокумента Тогда
		Объект.ВалютаДокумента = ВалютаМСФО;
		УстановитьКурсКратностьДокумента(Объект.ВалютаДокумента, Объект.Дата, Объект.КурсДокумента, Объект.КратностьДокумента);
	КонецЕсли;

	
КонецПроцедуры // ЗаполнитьВалютуМСФО()

&НаСервереБезКонтекста
Процедура УстановитьКурсКратностьДокумента(Валюта, Дата, Курс, Кратность)
    
    СтрКурса = бит_КурсыВалют.ПолучитьКурсВалюты(Валюта, Дата);
    
    Курс      = СтрКурса.Курс;
    Кратность = СтрКурса.Кратность;
    
КонецПроцедуры // ИзменениеВалюты()

&НаСервере
Процедура ИзменениеОрганизацииСервер(ТекстСообщения)
	
	// Очистка табличной части
	Объект.ОсновныеСредства.Очистить();
	
	ПараметрыПроверки = бит_ОбщегоНазначения.НовыеПараметрыПроверитьПринадлежностьАналитики();
	ПараметрыПроверки.Контейнер 			   = Объект;
	ПараметрыПроверки.ИмяРеквизита			   = "Подразделение";
	ПараметрыПроверки.ИмяПроверочногоРеквизита = "Владелец";
	ПараметрыПроверки.ИмяКонтрольногоЗначения  = "Организация";
	ПараметрыПроверки.ИмяТипа 				   = "СправочникСсылка.ПодразделенияОрганизаций";
	ПараметрыПроверки.НачалоСообщения 		   = НСтр("ru='В документе';en='In Document'");
	ПараметрыПроверки.Заголовок 			   = НСтр("ru='Изменение значения реквизита Организация';en='Changing the details of the organization'");
	ПараметрыПроверки.ТекстСообщения		   = ТекстСообщения; 
	
	// Проверка подразделения
	бит_ОбщегоНазначения.ПроверитьПринадлежностьАналитики(ПараметрыПроверки);
	
	// Заполним валюту МСФО.
	ЗаполнитьВалютуМСФО(); 
	
КонецПроцедуры // ИзменениеОрганизацииСервер()                 

&НаСервере
Процедура ПроверитьВыбранноеПодразделение(ВыбранноеЗначение, СтандартнаяОбработка)

	Если ВыбранноеЗначение.Владелец <> Объект.Организация Тогда
		СтандартнаяОбработка = Ложь;	
	КонецЕсли;

КонецПроцедуры // ПроверитьВыбранноеПодразделение()

&НаСервере
Процедура ПерезаполнитьПараметрыТаблицыОССервер(МожноПерезаполнятьДанныеПоОС)
		
	СписокОС = Объект.ОсновныеСредства.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство");
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(СписокОС, Истина);
	
	Если СписокОС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Получим параметры по ОС.
	ПолучитьПараметрыОССервер(СписокОС, , Истина, МожноПерезаполнятьДанныеПоОС);

КонецПроцедуры // ПерезаполнитьПараметрыТаблицыОССервер()

&НаСервере
Функция СформироватьМассивНедоступныхПараметровАмортизации(ТекущиеДанные, Префикс = "", ЭтоУправлениеДоступность = Ложь)
	
	МассивНедоступныхПараметров = Новый Массив;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат МассивНедоступныхПараметров;
	КонецЕсли;
	
	МенеджерПеречисления 		     = Перечисления.бит_му_МетодыНачисленияАмортизации;
	МетодНачисленияАмортизации_Новый = ТекущиеДанные.МетодНачисленияАмортизации;
	
	Если МетодНачисленияАмортизации_Новый = МенеджерПеречисления.Линейный Тогда
		
		МассивНедоступныхПараметров.Добавить(Префикс + "КоэффициентУскорения");
		МассивНедоступныхПараметров.Добавить(Префикс + "ОбъемПродукцииРабот");
		
		Если ЭтоУправлениеДоступность Тогда
			МассивНедоступныхПараметров.Добавить(Префикс + "ФактОбъемПродукцииРабот");
			МассивНедоступныхПараметров.Добавить(Префикс + "ОстОбъемПродукцииРабот");
		КонецЕсли;
		
	ИначеЕсли МетодНачисленияАмортизации_Новый = МенеджерПеречисления.УменьшаемогоОстатка Тогда
		
		МассивНедоступныхПараметров.Добавить(Префикс + "ОбъемПродукцииРабот");
		
		Если ЭтоУправлениеДоступность Тогда
			МассивНедоступныхПараметров.Добавить(Префикс + "ФактОбъемПродукцииРабот");
			МассивНедоступныхПараметров.Добавить(Префикс + "ОстОбъемПродукцииРабот");
		КонецЕсли;
		
	ИначеЕсли МетодНачисленияАмортизации_Новый = МенеджерПеречисления.Производственный Тогда
		
		МассивНедоступныхПараметров.Добавить(Префикс + "КоэффициентУскорения");
		
	КонецЕсли;
	
	Возврат МассивНедоступныхПараметров;
	
КонецФункции // СформироватьМассивНедоступныхПараметровАмортизации()

&НаСервере
Процедура ВосстановитьОтображениеДанныхФормы()

	ВосстановитьКоличествоДоступныхСубконто();
	бит_му_ВНА.ВосстановитьИнвентарныеНомераТаблицыОС(Объект.ОсновныеСредства, КэшЗначений.СоответствиеОС_ИнвентарныйНомер);	

	ВыполнитьВсеРасчетыТаблицыОС();
	 
КонецПроцедуры // ВосстановитьОтображениеДанныхФормы()

&НаСервере
Процедура ВыборСчетаВТабличномПоле(ТекущиеДанные, ИмяСчета, ИмяСубконто)

	НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(ТекущиеДанные[ИмяСчета], КоличествоСубконтоМУ);									  
	
	бит_БухгалтерскийУчет.ПривестиЗначенияСубконто(ТекущиеДанные, НастройкиСубконто, ИмяСубконто);

    СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущиеДанные[ИмяСчета]);
	ТекущиеДанные["КоличествоДоступных" + ИмяСубконто] = СвСч.КоличествоСубконто;

КонецПроцедуры // ВыборСчетаВТабличномПоле()

&НаСервере
Процедура СинхронизироватьРеквизитыСтрокиОС(ТекущиеДанные, ИмяСубконто)
	
	Если ТекущиеДанные = Неопределено Тогда
		 Возврат;
	КонецЕсли; 

	Если ЗначениеЗаполнено(ТекущиеДанные.ОсновноеСредство) Тогда
		
		// Адаптация для ERP. Начало. 18.03.2014{{
		ТипОС = Тип(бит_ОбщегоНазначения.ПолучитьИмяТипаОсновныеСредства());
		// Адаптация для ERP. Конец. 18.03.2014}}
		
		Для Ном = 1 По КоличествоСубконтоМУ Цикл
			
			ТекИмяСубконто = ИмяСубконто + Ном;
			
			Если ТипЗнч(ТекущиеДанные[ТекИмяСубконто]) = ТипОС Тогда
				ТекущиеДанные[ТекИмяСубконто] = ТекущиеДанные.ОсновноеСредство;
			КонецЕсли; 
		
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры // СинхронизироватьРеквизитыСтрокиОС()
  
&НаСервере
Процедура ИзменениеОсновногоСредстваСервер(ИДСтроки, МожноПерезаполнятьДанныеПоОС)
	
	ТекущиеДанные = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИДСтроки);
	
	// Заполнить инвентарный номер ОС
	СоответствиеОС_ИнвентарныйНомер = КэшЗначений.СоответствиеОС_ИнвентарныйНомер;
	бит_му_ВНА.ЗаполнитьИнвентарныйНомерТекущегоОС(ТекущиеДанные, Объект.Организация, СоответствиеОС_ИнвентарныйНомер);	
	КэшЗначений.Вставить("СоответствиеОС_ИнвентарныйНомер", СоответствиеОС_ИнвентарныйНомер);
		
	// Получим параметры по ОС.
	ПолучитьПараметрыОССервер(ТекущиеДанные, , , МожноПерезаполнятьДанныеПоОС);			 	
	
	// Синхронизация реквизитов строки ОС
	СинхронизироватьРеквизитыСтрокиОС(ТекущиеДанные, "Субконто");
	
	ВыполнитьВсеРасчетыДляСтрокиОС(ТекущиеДанные);
	
КонецПроцедуры // ИзменениеОсновногоСредстваСервер()

&НаСервере
Процедура ИзменениеМетодаНачисленияАмортизацииСервер(ИДСтроки)
	
	ТекущиеДанные = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИДСтроки);
	
	МассивНедоступныхПараметров = СформироватьМассивНедоступныхПараметровАмортизации(ТекущиеДанные);
	
	// Очистим параметры ОС недоступные для выбранного метода ничасления амортизации.
	бит_му_ВНА.ОчиститьНедоступныеПараметрыАмортизации(ТекущиеДанные, , МассивНедоступныхПараметров);
	
КонецПроцедуры // ИзменениеМетодаНачисленияАмортизацииСервер()

&НаСервере
Процедура ИзменениеСчетаНезавершенногоСтроительстваСервер(ИДСтроки = Неопределено)
	
	ТекущиеДанные = ?(ТипЗнч(ИДСтроки) = Тип("Число")
			 			, Объект.ОсновныеСредства.НайтиПоИдентификатору(ИДСтроки)
						, ИДСтроки);	
						
	ВыборСчетаВТабличномПоле(ТекущиеДанные, "СчетНезавершенногоСтроительства", "Субконто");
		
	// Синхронизируем реквизиты строки ОС.
	СинхронизироватьРеквизитыСтрокиОС(ТекущиеДанные, "Субконто");
	
КонецПроцедуры // ИзменениеСчетаНезавершенногоСтроительстваСервер()
            
&НаСервере
Процедура ВосстановитьКоличествоДоступныхСубконто()
	
	// Восстанавливаем настройки субконто в зависимости от счетов учета.
	Для каждого СтрокаТаблицы Из Объект.ОсновныеСредства Цикл
        
        СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаТаблицы.СчетНезавершенногоСтроительства);
		СтрокаТаблицы.КоличествоДоступныхСубконто = СвСч.КоличествоСубконто;
				
	КонецЦикла;
	
КонецПроцедуры // ВосстановитьКоличествоДоступныхСубконто()

&НаСервере
Процедура УстановитьОформлениеПараметровАмортизации()
	
	Для Каждого ТекущийМетод Из Перечисления.бит_му_МетодыНачисленияАмортизации Цикл
						
		СтруктураОформления = Новый Структура("ТолькоПросмотр, ЦветФона", Истина, ЦветаСтиля.ДатаГрафикаИзмененнаяФон);
		СтруктураУсловия 	= Новый Структура("УсловиеЛевое, УсловиеПравое"
													, "Объект.ОсновныеСредства.МетодНачисленияАмортизации"
													, ТекущийМетод);
		ИмитацияСтроки 		   = Новый Структура("МетодНачисленияАмортизации", ТекущийМетод);
		МассивОформляемыхПолей = СформироватьМассивНедоступныхПараметровАмортизации(ИмитацияСтроки, "ОсновныеСредства");													
													
		СтруктураУО = Новый Структура;
		СтруктураУО.Вставить("СтруктураОформления"   , СтруктураОформления);
		СтруктураУО.Вставить("СтруктураУсловия"      , СтруктураУсловия);
		СтруктураУО.Вставить("МассивОформляемыхПолей", МассивОформляемыхПолей);
		
		Представление = Нстр("ru = 'Оформление по методу начисления амортизации'; en = 'Depreciation Calculation'");
		бит_РаботаСДиалогамиСервер.ДобавитьЭлементУсловногоОформления(УсловноеОформление, Представление, СтруктураУО);
		
	КонецЦикла;
	
КонецПроцедуры // УстановитьОформлениеПараметровАмортизации()

&НаСервере
Процедура НастроитьОформлениеФормы()
	
	// Оформление
	бит_БухгалтерскийУчет.УстановитьОформлениеСубконтоТаблицы(УсловноеОформление, 
		"ОсновныеСредства", "Субконто", "КоличествоДоступныхСубконто", КоличествоСубконтоМУ,,,,,, Истина);
																   															   
	УстановитьОформлениеПараметровАмортизации();
	
	Элементы.ОтразитьВЗакрытомПериоде.Видимость = бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(
		Пользователи.ТекущийПользователь(), ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешеноОтражениеДокументовВЗакрытомПериоде);

КонецПроцедуры

&НаСервере
Процедура ВыполнитьВсеРасчетыДляСтрокиОС(СтрокаОС)

	Документы.бит_му_МодернизацияОС.ВыполнитьВсеРасчетыДляСтрокиОС(СтрокаОС);
	
КонецПроцедуры // ВыполнитьВсеРасчетыДляСтрокиОС()

&НаСервере
Процедура ВыполнитьВсеРасчетыТаблицыОС()

	Для каждого СтрокаОС Из Объект.ОсновныеСредства Цикл
		ВыполнитьВсеРасчетыДляСтрокиОС(СтрокаОС);
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьВсеРасчетыТаблицыОС()

&НаСервере
Процедура ПолучитьПараметрыОССервер(ИдСтроки, Отказ = Ложь, НеИзменяемыеПараметры = Ложь, МожноПерезаполнятьДанныеПоОС = Ложь)

	ЭтоМассив = ТипЗнч(ИдСтроки) = Тип("Массив");
	
	Если ЭтоМассив Тогда
		
		МассивОС = ИдСтроки;
		
	Иначе	
		
		ТекущиеДанные = ?(ТипЗнч(ИдСтроки) = Тип("Число")
				 			, Объект.ОсновныеСредства.НайтиПоИдентификатору(ИдСтроки)
							, ИдСтроки); 						
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		МассивОС = ТекущиеДанные.ОсновноеСредство;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МассивОС) Тогда
		Возврат;
	КонецЕсли; 
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Не НеИзменяемыеПараметры Тогда
		              		
		// Проверим ОС.
		ДокОбъект.ПроверитьОСПриВыборе(МассивОС, Отказ);
	                       	
		Если Отказ Тогда
			
			Если Не ЭтоМассив Тогда
				ИмяСправочникаОС = бит_ОбщегоНазначения.ПолучитьИмяСправочникаОсновныеСредства();
				ТекущиеДанные.ОсновноеСредство = Справочники[ИмяСправочникаОС].ПустаяСсылка();
			КонецЕсли;			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;

	Если МожноПерезаполнятьДанныеПоОС Тогда
		// Заполним данные по основным средствам.
		ДокОбъект.ЗаполнитьДанныеПоОсновнымСредствам(МассивОС, НеИзменяемыеПараметры, ?(ЭтоМассив, Неопределено, ТекущиеДанные));
		Если ЭтоМассив Тогда
			ЗначениеВДанныеФормы(ДокОбъект, Объект);
			ВосстановитьОтображениеДанныхФормы();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПолучитьПараметрыОССервер()

&НаСервере
Процедура ДобавитьЗагрузитьОС(ВыбранноеЗначение, МожноПерезаполнятьДанныеПоОС)

	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ЗаполнитьОсновныеСредства(ВыбранноеЗначение, МожноПерезаполнятьДанныеПоОС);
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
		
	ВосстановитьОтображениеДанныхФормы();
		
КонецПроцедуры // ДобавитьЗагрузитьОС()

// Процедура обрабатывает изменение валюты документа. Клиент.
// 
// Параметры:
//  Нет.
// 
&НаКлиенте
Процедура ИзменениеВалютыКлиент() 
	
	ИзменениеВалютыСервер();
	
	ТаблицаОбъекта = Объект.ОсновныеСредства;
	
	// Спросим, а не пересчитать ли суммы.
	Если Не мКэшРеквизитовФормы.ВалютаДокумента = Объект.ВалютаДокумента 
		И ТаблицаОбъекта.Количество()>0 
		И ЗначениеЗаполнено(мКэшРеквизитовФормы.ВалютаДокумента)
		И ЗначениеЗаполнено(Объект.ВалютаДокумента)Тогда

	    Оповещение = Новый ОписаниеОповещения("ИзменениеВалютыЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Изменилась валюта документа. Пересчитать суммы документа?';
		                    |en='Document currency has changed. Recalculate document total?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
		
	Иначе
		
		ДобавитьВКэш("ВалютаДокумента");
		ДобавитьВКэш("КратностьДокумента");
		ДобавитьВКэш("КурсДокумента");

	КонецЕсли;
	
КонецПроцедуры // ИзменениеВалютыКлиент()

// Процедура-обработчик оповещения вопроса из процедуры ИзменениеВалютыКлиент.
// 
&НаКлиенте
Процедура ИзменениеВалютыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ТаблицаОбъекта = Объект.ОсновныеСредства;
		
		// Получим курсы валют на дату принятия к учету для каждого ОС.
		КурсыСтарые = ПолучитьКурсыВалютПоПериодам(мКэшРеквизитовФормы);
		КурсыНовые = ПолучитьКурсыВалютПоПериодам(,Истина);
		
		МассивСуммДляПересчета = Новый Массив;
		МассивСуммДляПересчета.Добавить("Стоимость");
		МассивСуммДляПересчета.Добавить("СуммаМодернизации");
		МассивСуммДляПересчета.Добавить("СуммаФактическогоОбесценения");
		МассивСуммДляПересчета.Добавить("Амортизация");
		МассивСуммДляПересчета.Добавить("ЛиквидационнаяСтоимость_Старый");
		МассивСуммДляПересчета.Добавить("ЛиквидационнаяСтоимость");
		
		Для Каждого СтрокаТаблицы Из ТаблицаОбъекта Цикл
			
				Для каждого ИмяСуммы Из МассивСуммДляПересчета Цикл
					
					// Сумму модернизации и ликвидационную стоимость пересчитаем на дату документа.
					Если ИмяСуммы = "СуммаМодернизации" ИЛИ ИмяСуммы = "ЛиквидационнаяСтоимость" Тогда
						
						СтрокаТаблицы[ИмяСуммы] = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы[ИмяСуммы]
																							   ,мКэшРеквизитовФормы.ВалютаДокумента
																							   ,Объект.ВалютаДокумента
																							   ,мКэшРеквизитовФормы.КурсДокумента
																							   ,Объект.КурсДокумента
																							   ,мКэшРеквизитовФормы.КратностьДокумента
																							   ,Объект.КратностьДокумента);
																							
					// Остальные суммы пересчитаем на дату принятия к учету.
					Иначе
						
						Если НЕ КурсыСтарые[СтрокаТаблицы.ОсновноеСредство] = Неопределено 
							И НЕ КурсыНовые[СтрокаТаблицы.ОсновноеСредство] = Неопределено Тогда
							
							СтарыеКурсы = КурсыСтарые[СтрокаТаблицы.ОсновноеСредство].СтарыеКурсы;
							НовыеКурсы = КурсыНовые[СтрокаТаблицы.ОсновноеСредство].НовыеКурсы;

						
							СтрокаТаблицы[ИмяСуммы] = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы[ИмяСуммы]
																										,СтарыеКурсы.Валюта
																										,НовыеКурсы.Валюта
																										,СтарыеКурсы.Курс
																										,НовыеКурсы.Курс
																										,СтарыеКурсы.Кратность
						                                                                      			,НовыеКурсы.Кратность);
						КонецЕсли;
																									
					КонецЕсли; 
					
			
				КонецЦикла; 
		КонецЦикла;
	КонецЕсли;
	
	ВычислитьОстаточнуюСтоимость();
	
	ДобавитьВКэш("ВалютаДокумента");
	ДобавитьВКэш("КратностьДокумента");
	ДобавитьВКэш("КурсДокумента");

КонецПроцедуры // ИзменениеВалютыЗавершение()

&НаСервере
Функция ПолучитьКурсыВалютПоПериодам(КешСтарыеКурсы = Неопределено, флНовыеКурсы = Ложь)
	
	Если флНовыеКурсы Тогда
		
		НовыеКурсы = Новый Структура;
		НовыеКурсы.Вставить("Валюта", Объект.ВалютаДокумента);
		НовыеКурсы.Вставить("Кратность", Объект.КратностьДокумента);
		НовыеКурсы.Вставить("Курс", Объект.КурсДокумента);
		
		СтруктураКурсовВалют = Новый Структура;
		СтруктураКурсовВалют.Вставить("НовыеКурсы", НовыеКурсы);
		
	Иначе
		
		СтарыеКурсы = Новый Структура;
		СтарыеКурсы.Вставить("Валюта", КешСтарыеКурсы.ВалютаДокумента); 
		СтарыеКурсы.Вставить("Кратность", КешСтарыеКурсы.КратностьДокумента);
		СтарыеКурсы.Вставить("Курс", КешСтарыеКурсы.КурсДокумента);
		
		СтруктураКурсовВалют = Новый Структура;
		СтруктураКурсовВалют.Вставить("СтарыеКурсы", СтарыеКурсы);
		
	КонецЕсли; 
	
	МассивОС = Объект.ОсновныеСредства.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство");
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаДанных = ДокументОбъект.ПодготовитьТаблицуДатПринятияОС(МассивОС);
	ТаблицаПериодов = ТаблицаДанных.Скопировать(, "Период");
	Курсы = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, СтруктураКурсовВалют);
	
	СоответствиеКурсовИОС = Новый Соответствие;
	
	Для каждого Строка Из ТаблицаДанных Цикл
		СоответствиеКурсовИОС.Вставить(Строка.ОсновноеСредство, Курсы[Строка.Период])
	КонецЦикла; 

	Возврат СоответствиеКурсовИОС;
	
КонецФункции

// Процедура обрабатывает изменение валюты документа.
// 
// Параметры:
//  Нет.
// 
&НаСервере
Процедура ИзменениеВалютыСервер()
	                 
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ИзменениеВалютыМодуль();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	  
КонецПроцедуры // ИзменениеВалютыСервер()

// Функция получает параметры, передаваемые в обработку подбора ОС.
//
&НаСервере
Функция ЗаполнитьПараметрыПодбора()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ПараметрыПодбора = ДокументОбъект.ЗаполнитьПараметрыПодбора();
	
	Возврат ПараметрыПодбора;
	
КонецФункции // ЗаполнитьПараметрыПодбора()

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
// 
// Параметры:
//  Нет
// 
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьТекущиеЗначенияРеквизитовФормы()

// Процедура добавляет в кэш реквизитов текущее значение заданного реквизита.
// 
// Параметры:
// 	ИмяРеквизита - Строка
// 
&НаКлиенте
Процедура ДобавитьВКэш(ИмяРеквизита)
	
	мКэшРеквизитовФормы[ИмяРеквизита] = Объект[ИмяРеквизита];	
	
КонецПроцедуры // ДобавитьВКэш()

// Процедура извлекает из кэша и присваивает объекту значение заданного реквизита.
// 
// Параметры:
// 	ИмяРеквизита - Строка
// 
&НаКлиенте
Процедура ИзвлечьИзКэша(ИмяРеквизита)
	
	Объект[ИмяРеквизита] = мКэшРеквизитовФормы[ИмяРеквизита];
	
КонецПроцедуры // ИзвлечьИзКэша()

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
Процедура УстановитьПараметрыВыбораДляСчетов()

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.ОсновныеСредстваСчетНезавершенногоСтроительства);
	
	бит_РаботаСДиалогамиСервер.УстановитьПараметрыВыбораДляЭлементов(МассивЭлементов);
	
КонецПроцедуры // УстановитьПараметрыВыбораДляСчетов() 

&НаКлиенте
Функция СформироватьДеревоВидовОпераций()

	КореньДерева = ДеревоВидовОпераций.ПолучитьЭлементы();
		
	Для каждого КлЗнч Из КэшЗначений.Перечисления.бит_му_ВидыОперацийМодернизацияОС Цикл
		
		НовСтрока = КореньДерева.Добавить();		
		НовСтрока.ВидОперации = КлЗнч.Значение;
	
	КонецЦикла;

КонецФункции // СформироватьДеревоВидовОпераций()

// Процедура выводит текст свообщений пользователю.
// 
// Параметры:
//  ТекстСообщения - Строка
// 
&НаКлиенте
Процедура ВывестиТекстСообщенийПользователю(ТекстСообщения)

	Если ТекстСообщения <> "" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	

КонецПроцедуры // ВывестиТекстСообщенийПользователю()

// Функция проверяет возможность заполнения параметров ОС.
// 
// Параметры:
//  Нет
//  
// Возвращаемое значение:
//   Булево
// 
&НаКлиенте
Функция ПроверитьВозможностьЗаполненияПараметров()

	МожноПерезаполнятьДанныеПоОС = ЗначениеЗаполнено(Объект.Организация);
	
	Если Не МожноПерезаполнятьДанныеПоОС Тогда
		ТекстСообщения = НСтр("ru='Не выбрана организация - данные по основному средству не были заполнены.';
		                      |en='Not selected organization - data on fixed assets have not been filled.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

	Возврат МожноПерезаполнятьДанныеПоОС;
	
КонецФункции // ПроыеритьВозможностьЗаполненияПараметров()

&НаКлиенте
Процедура ВычислитьОставшийсяСрокПолезногоИспользования()
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ОстСрокИспользования = ТекущиеДанные.СрокПолезногоИспользования 
										 - ТекущиеДанные.ФактСрокИспользования;
	
КонецПроцедуры // ВычислитьОставшийсяСрокПолезногоИспользования()
									 
&НаКлиенте
Процедура ВычислитьОставшийсяОбъемПродукцииРабот()
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ОстОбъемПродукцииРабот = ТекущиеДанные.ОбъемПродукцииРабот 
										 - ТекущиеДанные.ФактОбъемПродукцииРабот;
	
КонецПроцедуры // ВычислитьОставшийсяОбъемПродукцииРабот()

&НаКлиенте
Процедура ВычислитьОстаточнуюСтоимость()
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ОстСтоимость = ТекущиеДанные.Стоимость 
								+ ТекущиеДанные.СуммаМодернизации 
								- ТекущиеДанные.СуммаФактическогоОбесценения 
								- ТекущиеДанные.Амортизация;
	
КонецПроцедуры // ВычислитьОстаточнуюСтоимость()
                   								 
&НаКлиенте
Функция ПолучитьЗначениеСубконтоТабПоле(ТекущиеДанные, ИмяТабличногоПоля, ИмяЭлемента)

	ЗначениеСубконто = Неопределено;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ИмяРеквизита      = СтрЗаменить(ИмяЭлемента, ИмяТабличногоПоля, "");
		ЗначениеСубконто  = ТекущиеДанные[ИмяРеквизита];
		
	КонецЕсли; 

	Возврат ЗначениеСубконто;
	
КонецФункции // ПолучитьЗначениеСубконтоТабПоле()

&НаКлиенте
Процедура ИзменениеСубконто(Контейнер, ИмяСубконто, ЗначениеСубконто)

	СтруктураСубконто = бит_БухгалтерияКлиент.ПодготовитьСтруктуруСубконто(Контейнер, 
		ИмяСубконто, КоличествоСубконтоМУ);

	бит_БухгалтерияВызовСервера.ОбработатьИзменениеСубконто(СтруктураСубконто, 
		ИмяСубконто, ЗначениеСубконто, КоличествоСубконтоМУ);
													
	бит_БухгалтерияКлиент.ЗаполнитьСубконтоПоСтруктуре(СтруктураСубконто, Контейнер, 
		ИмяСубконто, "", КоличествоСубконтоМУ);																   

КонецПроцедуры // ИзменениеСубконто()

&НаКлиенте
Процедура НачалоВыбораСубконто(Элемент, СтандартнаяОбработка, Контейнер, ИмяСубконто, ЗначениеСубконто)
	
	СтруктураПараметров = бит_БухгалтерияКлиент.ПодготовитьПараметрыВыбораСубконто(Контейнер, 
		ИмяСубконто, ЗначениеСубконто, КоличествоСубконтоМУ, Объект);	
	
	// Установим параметры выбора субконто
	бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элемент, СтруктураПараметров);
	
КонецПроцедуры

// Процедура окончание выбора вида операции.
// 
&НаКлиенте 
Процедура ВыборВидаОперацииОкончание(СтруктураПараметров, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;	
	Если СтруктураПараметров = Неопределено Тогда
		Отказ = Истина;	
	КонецЕсли;
	
	ПриОткрытииЭтоНовыйОкончание(СтруктураПараметров, Отказ);
		
КонецПроцедуры // ВыборВидаОперацииОкончание()

&НаКлиенте
Процедура ПриОткрытииЭтоНовыйОкончание(СтруктураПараметров, Отказ)

	Если СтруктураПараметров <> Неопределено Тогда
	
		Объект.ВидОперации = СтруктураПараметров.ВидОперации;																					   
	
	КонецЕсли; 
	
	ПриОткрытииПромежуточная(Отказ);
	ПриОткрытииОкончание();

КонецПроцедуры // ПриОткрытииЭтоНовыйОкончание()

&НаКлиенте
Процедура ПриОткрытииПромежуточная(Отказ)

	Если Отказ Тогда
		ЭтотОбъект.Закрыть();
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытииПромежуточная()

// Процедура выполняет окончательные операции по открытию формы. 
// 
&НаКлиенте
Процедура ПриОткрытииОкончание()

	// Имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	мКэшРеквизитовФормы.Вставить("Дата");
	мКэшРеквизитовФормы.Вставить("Организация"); 
	мКэшРеквизитовФормы.Вставить("ВалютаДокумента");
	мКэшРеквизитовФормы.Вставить("КурсДокумента");
	мКэшРеквизитовФормы.Вставить("КратностьДокумента");
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	        		
	// Заполнение кэша субконто и установка видимости, доступности.
	ЗаполнитьКэшНастроекСубконто(мНастройкиСубконтоСчетовМУ);
	
КонецПроцедуры // ПриОткрытииОкончание()


#КонецОбласти

#КонецОбласти
